# побудуйте класс-адаптер, який дозволить переганяти об'єкти з апі в базу і навпаки
# він має робити тільки читання і запис.
# в якості ендпойнта для апі візьміть https://restful-api.dev/
# для частини з sql створіть нову таблицю. т.як ендпойнт створює айді запису самостійно,
# реалізуйте наступні зв'язки:
# api=>sql
# POST+GET=>INSERT+SELECT
# PUT+GET=>UPDATE+SELECT
# sql=>api
# UPDATE+SELECT=>PUT+GET
# де вказано +GET, +SELECT значить треба виконати ці операції після операцій зміни/створення,
# щоб пересвідчитись, що об'єкти створились/оновились правильно.
# напишіть довільну кількість тестів, щоб покрити функціонал цього адаптера.
# Приклад . Ви створюєте об'єкт в апі через POST, пересвідчуєтесь, що він створився через GET,
# записуєте поля об'єкта в таблицю за допомогою INSERT, перевіряєте, чи створився запис за допомогою SELECT
#
# *необов'язкова задача:
# додайте аналогічний функціонал для MongoDb
