# Оберіть будь-який сайт. повторіть зроблене на лекції для нього. Реалізуйте інстанціювання драйвера через фікстуру,
# Реалізуйте пейдж обжекти, додайте базові елементи типу кліку миши, сенд кейс в базовому класі.
# Напишіть 10 тестів, більше за бажанням
# ============================================
# HW 17
# Допишіть домашнє завдання з попереднього дз, додавши Page Factory pattern, реалізуйте інкапсуляцію локаторів.
# і допишіть ще 10+ тестів
# *необов'язкова задача. опрацюйте створення таплів локаторів
# ============================================
# HW 18
# Створіть класи Cookies і LocalStorage. Нехай вони через веб драйвер зможуть зберігати і повертати відповідно кукі
# і аргументи з локал стореджа. нехай ці класи ініціалізуються на BasePage
# Параметризуйте категорії або сторінки продукту, любі однотипні сторінки на сайті, для якого ви робите фреймворк.
# Додайте ще 10 тестів до фреймворку на ці теми і/або попередні
